## 📋 Plan de Terraform (Dev) con LocalStack

<details>
<summary>Ver cambios propuestos</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_network.webapp_network will be created
  + resource "docker_network" "webapp_network" {
      + driver      = (known after apply)
      + id          = (known after apply)
      + internal    = (known after apply)
      + ipam_driver = "default"
      + name        = "webapp-network"
      + options     = (known after apply)
      + scope       = (known after apply)

      + ipam_config (known after apply)
    }

  # docker_volume.db_volume will be created
  + resource "docker_volume" "db_volume" {
      + driver     = (known after apply)
      + id         = (known after apply)
      + mountpoint = (known after apply)
      + name       = "db-data-dev"
    }

  # module.cache-service.docker_container.redis will be created
  + resource "docker_container" "redis" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "webapp-cache"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "always"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval     = "5s"
          + retries      = 5
          + start_period = "0s"
          + test         = [
              + "CMD",
              + "redis-cli",
              + "ping",
            ]
          + timeout      = "3s"
        }

      + labels (known after apply)

      + networks_advanced {
          + aliases      = []
          + name         = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.cache-service.docker_image.redis will be created
  + resource "docker_image" "redis" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "redis:7"
      + repo_digest = (known after apply)
    }

  # module.database.docker_container.postgres will be created
  + resource "docker_container" "postgres" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (sensitive value)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "webapp-db"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "always"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval     = "10s"
          + retries      = 5
          + start_period = "0s"
          + test         = [
              + "CMD-SHELL",
              + "pg_isready -U $POSTGRES_USER",
            ]
          + timeout      = "5s"
        }

      + labels (known after apply)

      + networks_advanced {
          + aliases      = []
          + name         = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + volumes {
          + container_path = "/docker-entrypoint-initdb.d/init.sql"
          + host_path      = "/home/runner/work/d27-cicd/d27-cicd/modules/database/init.sql"
          + read_only      = true
            # (2 unchanged attributes hidden)
        }
      + volumes {
          + container_path = "/var/lib/postgresql/data"
          + volume_name    = "db-data-dev"
            # (2 unchanged attributes hidden)
        }
    }

  # module.database.docker_image.postgres will be created
  + resource "docker_image" "postgres" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "postgres:15"
      + repo_digest = (known after apply)
    }

  # module.nginx-service.docker_container.nginx will be created
  + resource "docker_container" "nginx" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = [
          + "/bin/sh",
          + "-c",
          + "rm -f /etc/nginx/conf.d/default.conf && nginx -g 'daemon off;'",
        ]
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (known after apply)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "webapp-nginx"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "no"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval     = "10s"
          + retries      = 3
          + start_period = "0s"
          + test         = [
              + "CMD",
              + "wget",
              + "-qO-",
              + "http://localhost/health",
            ]
          + timeout      = "3s"
        }

      + labels (known after apply)

      + networks_advanced {
          + aliases      = []
          + name         = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + ports {
          + external = 80
          + internal = 80
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }

      + volumes {
          + container_path = "/etc/nginx/conf.d/vote.conf"
          + host_path      = "/home/runner/work/d27-cicd/d27-cicd/modules/proxy-service/nginx.conf"
          + read_only      = true
            # (2 unchanged attributes hidden)
        }
    }

  # module.nginx-service.docker_image.nginx will be created
  + resource "docker_image" "nginx" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "nginx:alpine"
      + repo_digest = (known after apply)
    }

  # module.results-node.docker_container.results will be created
  + resource "docker_container" "results" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (sensitive value)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "webapp-results"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "unless-stopped"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval     = "10s"
          + retries      = 5
          + start_period = "40s"
          + test         = [
              + "CMD",
              + "curl",
              + "-f",
              + "http://localhost:3010/healthz",
            ]
          + timeout      = "5s"
        }

      + labels (known after apply)

      + networks_advanced {
          + aliases      = []
          + name         = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + ports {
          + external = 3010
          + internal = 3010
          + ip       = "0.0.0.0"
          + protocol = "tcp"
        }
    }

  # module.results-node.docker_image.results will be created
  + resource "docker_image" "results" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "rodvelinc/result"
      + repo_digest = (known after apply)
    }

  # module.vote-service.docker_container.vote will be created
  + resource "docker_container" "vote" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = [
          + "REDIS_HOST=webapp-cache",
          + "REDIS_PORT=6379",
        ]
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "vote-service"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "always"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval     = "10s"
          + retries      = 3
          + start_period = "0s"
          + test         = [
              + "CMD",
              + "curl",
              + "-f",
              + "http://localhost:80/",
            ]
          + timeout      = "5s"
        }

      + labels (known after apply)

      + networks_advanced {
          + aliases      = [
              + "vote-service",
            ]
          + name         = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.vote-service.docker_image.vote will be created
  + resource "docker_image" "vote" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "rodvelinc/vote"
      + repo_digest = (known after apply)
    }

  # module.worker-node.docker_container.worker will be created
  + resource "docker_container" "worker" {
      + attach                                      = false
      + bridge                                      = (known after apply)
      + command                                     = (known after apply)
      + container_logs                              = (known after apply)
      + container_read_refresh_timeout_milliseconds = 15000
      + entrypoint                                  = (known after apply)
      + env                                         = (sensitive value)
      + exit_code                                   = (known after apply)
      + hostname                                    = (known after apply)
      + id                                          = (known after apply)
      + image                                       = (known after apply)
      + init                                        = (known after apply)
      + ipc_mode                                    = (known after apply)
      + log_driver                                  = (known after apply)
      + logs                                        = false
      + must_run                                    = true
      + name                                        = "webapp-worker"
      + network_data                                = (known after apply)
      + read_only                                   = false
      + remove_volumes                              = true
      + restart                                     = "unless-stopped"
      + rm                                          = false
      + runtime                                     = (known after apply)
      + security_opts                               = (known after apply)
      + shm_size                                    = (known after apply)
      + start                                       = true
      + stdin_open                                  = false
      + stop_signal                                 = (known after apply)
      + stop_timeout                                = (known after apply)
      + tty                                         = false
      + wait                                        = false
      + wait_timeout                                = 60

      + healthcheck {
          + interval     = "10s"
          + retries      = 5
          + start_period = "40s"
          + test         = [
              + "CMD",
              + "curl",
              + "-f",
              + "http://localhost:3000/healthz",
            ]
          + timeout      = "5s"
        }

      + labels (known after apply)

      + networks_advanced {
          + aliases      = []
          + name         = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.worker-node.docker_image.worker will be created
  + resource "docker_image" "worker" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "rodvelinc/worker"
      + repo_digest = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cache_container_name    = "webapp-cache"
  + database_container_name = "webapp-db"
  + network_name            = "webapp-network"
  + result_app_url          = "http://localhost:3010"
  + vote_app_url            = "http://localhost:8080"

```

</details>

**✅ Validado con LocalStack**  
**📦 Backend:** S3 (terraform-state-roxs)  
**🌍 Ambiente:** Desarrollo  
